[
  {
    "title": "Really flexible and understanding workplace",
    "description": "I started working at Macy’s when I was 16. They were really flexible with my school schedule. Very formal and professional management, yet understanding. They also had many opportunities for bonuses.",
    "date": "April 26, 2022",
    "role": "Macy's Sales Associate",
    "location": "West Covina, CA",
    "company": "Macy's"
  },
  {
    "title": "It’s ok",
    "description": "it’s ok. people are ok. Hours are good. Managers not so much. repetitive and easy work. It gets pretty busy on weekends and holidays are pretty god awful. The store is open during ungodly hours like 8AM-11PM.",
    "date": "June 8, 2025",
    "role": "Stock Associate",
    "location": "Garden City, NY",
    "company": "Macy's"
  },
  {
    "title": "I used to love working at Macys",
    "description": "There is no more work life balance anymore. There is never enough help. The colleagues are wonderful but exhausted! Managment is exhausted. The new role out of hospitality is a joke.",
    "date": "June 7, 2025",
    "role": "Sales Manager",
    "location": "California",
    "company": "Macy's"
  },
  {
    "title": "Loved it",
    "description": "This was a great job! I really loved what I did in the most amazing way. This position was coveted by everyone in the store and I was so glad to be chosen",
    "date": "June 6, 2025",
    "role": "Glass Cleaner",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "Good place",
    "description": "This job isn't bad at all the pay is very decent , get to be hands on, Good boss, but the only negative aspect is the hours you work not as much as a work life balance",
    "date": "June 5, 2025",
    "role": "Asset Protection Detective",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "I enjoyed my time at Macy’s learned what a good work environment is",
    "description": "What is the best part of working at the company?",
    "date": "June 4, 2025",
    "role": "Customer Service Representative",
    "location": "Dublin, OH",
    "company": "Macy's"
  },
  {
    "title": "work home balance",
    "description": "i thought that macys had one of the better work home time balance programs. the supervisors really worked hard to make sure that if you needed time off you can get it. and they had the best online scheduling system. You could pick up shifts or advertise",
    "date": "June 4, 2025",
    "role": "Retail Sales Associate",
    "location": "Hillsboro, OR",
    "company": "Macy's"
  },
  {
    "title": "It's Retail",
    "description": "I enjoyed my time at Macy's. The pay wasn't bad for retail, and my colleagues were great. My managers were all good as well, which I didn't always find to be the case at other box retailers I worked at.",
    "date": "June 4, 2025",
    "role": "Anonymous",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "Amazing",
    "description": "Very good work place. Simple job. Felxible hours and somewhat good pay.",
    "date": "June 3, 2025",
    "role": "Cashier",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "It’s a good start company but not a forever",
    "description": "Macys was really good place to start a career but to be honest there is not much room for growth, it’s all about the buddy - buddy system rather than skill.",
    "date": "June 3, 2025",
    "role": "Operations Supervisor",
    "location": "Owasso, OK",
    "company": "Macy's"
  },
  {
    "title": "It had some ups but more downs.",
    "description": "I’ve worked for more than 6 months to earn my PTO, when it was last week to work there I didn’t not receive any of it. I felt like it was a waste of time to wait for 6 months to get your PTO and top of that I was told that it couldn’t cover a day which",
    "date": "June 3, 2025",
    "role": "Maintenance Technician",
    "location": "Rickenbacker Air National Guard Base, OH",
    "company": "Macy's"
  },
  {
    "title": "don't bother",
    "description": "So much went on at this store, poor management, micromanagement, never see your manager unless you need something from them.  The store manager did not care about the staff only money and they will constantly push you to get store cards during your",
    "date": "June 3, 2025",
    "role": "Sales Associate",
    "location": "Troy, MI",
    "company": "Macy's"
  },
  {
    "title": "Productive Environment with Room for Growth",
    "description": "I enjoy working in my department—we're goal-oriented and meet sales goals. However, I believe management could improve when it comes to addressing interpersonal conflicts within the team. A lack of timely mediation tends to allow a petty work culture",
    "date": "June 2, 2025",
    "role": "Sales Associate",
    "location": "Yonkers, NY",
    "company": "Macy's"
  },
  {
    "title": "Fun environment",
    "description": "The work environment was extremely friendly and the staff was authentically helpful with answering any questions or concerns I had.  The pay was also very competitive",
    "date": "June 2, 2025",
    "role": "Cashier",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "Loved it",
    "description": "Can learn alot if you want to. Some leadership are genius especially the veterans. Culture has changed and evolved over the years but I got my basics working hard with really humble, dedicated people. Macys is good American company.",
    "date": "June 2, 2025",
    "role": "Associate",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "Productive and engaging environment",
    "description": "I worked at the Sterling Heights location for several years. Overall, co-workers were pretty easy to get along with and the environment was professional 90% of the time. The one thing that needs to be fixed however is the fact leadership varies in regard",
    "date": "June 2, 2025",
    "role": "Customer Service Associate",
    "location": "Sterling Heights, MI",
    "company": "Macy's"
  },
  {
    "title": "Productive, but culture problems.",
    "description": "Working for Macy's was not the worst experience at all. I will say if you want a job where you can sit most of the time, then, pick some where else to work. The culture was not consistent with the training.",
    "date": "June 2, 2025",
    "role": "Front of House Support",
    "location": "Sterling Heights, MI",
    "company": "Macy's"
  },
  {
    "title": "good",
    "description": "pretty good envirenment. As a Macy’s jewelry sales associate, I enjoy helping customers find meaningful pieces, learning about fine jewelry, and working in a stylish, team-oriented environment.",
    "date": "June 1, 2025",
    "role": "Fine Jewelry Sales Associate",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "It was great at first, then got terrible when they started closing down stores.",
    "description": "What is the best part of working at the company?",
    "date": "June 1, 2025",
    "role": "Back of House Support",
    "location": "Garland, TX",
    "company": "Macy's"
  },
  {
    "title": "The overall experience is energizing.",
    "description": "What is the best part of working at the company?",
    "date": "June 1, 2025",
    "role": "Sales Associate/Customer Service",
    "location": "N/A",
    "company": "Macy's"
  },
  {
    "title": "Good job, but stressful management",
    "description": "The job itself wasn't bad, but management was breathing down our necks for credit. The people I worked with were very kind and helpful. The one big issue I had is that managers let certain people get away with things, if you sell more, you'll be a 'favorite'.",
    "date": "May 31, 2025",
    "role": "Fine Jewelry Sales Associate",
    "location": "Beavercreek, OH",
    "company": "Macy's"
  }
]